#include "inc/stm8s.h"
#include "inc/clk_init.h"
#include "inc/gpio_init.h"
#include "inc/ADC.h"
void delay(int t)
{
	int i,s;
	for(i=0;i<t;i++)
	{
		for(s=0;s<1512;s++)
		{
		}
	}
}

void main(void)
{
	unsigned int i=1, s=0;       //переменные для хранения данных
	Init_HSE();                           //инициализируем переферию
	gpio_init();
	
	ADC_CR1|=(1<<6);         //Делитель на 18            
	ADC_TDRH|=(1<<5);       //Отключаем тригер Шмидта для канала 5
	ADC_TDRH|=(1<<6);       //Отключаем тригер Шмидта для канала 6
	ADC_CR2&=~(1<<3);      //Выравнивание по левому краю
	ADC_CR1|=(1<<0);         //Первый запуск ADC
	       
    while(1)
    {
	/***********************читаем 5 канал************************************/
	ADC_CSR&=~((1<<3)|(1<<2)|(1<<1)|(1<<0)); //сбрасываем выбранный до этого канал
	ADC_CSR|=(1<<2)|(1<<0);                                 //Выбераем канал 5
    ADC_CR1|=(1<<0);                                              //запуск преобразования
	while(!(ADC_CSR&(1<<7)))                                 //ждем окончания преобразования
	{
		__asm__("nop\n");
	}
	s=ADC_DRH;                                                         //первым читается значемый регистр в данном случае ADC_DRH
	i=ADC_DRL;
	ADC_CSR&=~(1<<7);                                           //очищаем флаг окончания преобразования
	 PC_ODR=s;                                                           //выводим данные в порт С
	 delay(100);
	 s=i=0;
	 /***********************читаем 6 канал*************************************/
	ADC_CSR&=~((1<<3)|(1<<2)|(1<<1)|(1<<0));
	ADC_CSR|=(1<<2)|(1<<1);           
    ADC_CR1|=(1<<0);       
	while(!(ADC_CSR&(1<<7)))
	{
		__asm__("nop\n");
	}
	s=ADC_DRH;
	i=ADC_DRL;
	ADC_CSR&=~(1<<7);
	PC_ODR=s; 
	delay(100); 
	s=i=0;
	/**************************************************************/
	}

}
